Autodesk.Navisworks.Api.Bim360.ResourceInfo
Provides information about a BIM 360 Resource.

Autodesk.Navisworks.Api.Bim360.ResourceInfo.#ctor


Autodesk.Navisworks.Api.Bim360.ResourceInfo.AccountId
Identifier of Account the resource belongs to.

Autodesk.Navisworks.Api.Bim360.ResourceInfo.DisplayName
Display name of the resource.

Autodesk.Navisworks.Api.Bim360.ResourceInfo.Id
Version independent identifier for the resource.

Autodesk.Navisworks.Api.Bim360.ResourceInfo.ParentId
Optional identifier of Parent of the resource.

Autodesk.Navisworks.Api.Bim360.ResourceInfo.ProjectId
Identifier of Project the resource belongs to.

Autodesk.Navisworks.Api.Bim360.ResourceInfo.Type
Type of the resource.

Autodesk.Navisworks.Api.Bim360.ResourceInfo.VersionId
Version dependent identifier for the resource.